import type { ISlideData } from "../interfaces/interfaces";
import pic1 from '../../public/articlePics/articlepic1.jpeg'
import pic2 from '../../public/articlePics/articlepic2.jpeg'
import pic3 from '../../public/articlePics/articlepic3.jpeg'
import pic4 from '../../public/articlePics/articlepic4.jpeg'
import pic5 from '../../public/articlePics/articlepic5.jpeg'
import pic6 from '../../public/articlePics/articlepic6.jpeg'
import pic7 from '../../public/articlePics/articlepic7.jpeg'
import pic8 from '../../public/articlePics/articlepic8.jpeg'
import pic9 from '../../public/articlePics/articlepic9.jpeg'
import pic10 from '../../public/articlePics/articlepic10.jpeg'
import pic11 from '../../public/articlePics/articlepic11.jpeg'
import pic13 from '../../public/articlePics/articlepic13.jpeg'
import pic14 from '../../public/articlePics/articlepic14.jpeg'
import pic15 from '../../public/articlePics/articlepic15.jpeg'
import pic16 from '../../public/articlePics/articlepic16.jpeg'
import pic17 from '../../public/articlePics/artcilepic17.jpeg'
import pic18 from '../../public/articlePics/articlepic18.jpeg'
import pic19 from '../../public/articlePics/articlepic19.jpeg'
import pic20 from '../../public/articlePics/articlepic20.jpeg'
import pic21 from '../../public/articlePics/articlepic21.jpeg'
import pic22 from '../../public/articlePics/articlepic22.jpeg'
import pic23 from '../../public/articlePics/articlepic23.jpeg'
import pic24 from '../../public/articlePics/artcilepic24.jpeg'

export const propertyData: ISlideData[] = [
  {
    id: 1,
    headline: "הזכות למידע על ניהול הבית המשותף - האם היא מוחלטת?",
    description:
      "אם אתם גרים בבית משותף, ודאי יצא לכם לתהות לא פעם כיצד מתנהלים ענייני התחזוקה, הכספים והשירותים בבניין. מיא אחראי? למי אפשר לפנות אם יש בעיה? והכי חשוב - האם מותר לכם לדעת איך הכסף שלכם מנוהל? התשובה היא כן! בעלי הדירות זכאים לקבל מידע על ניהול הרכוש המשותף, כולל דוחות כספיים והחלטות הנוגעות לאחזקה.",
    image: pic1,
    category: "real-estate",
  },
  {
    id: 2,
    headline: "שימוש סביר בסוכך לחנייה ברכוש משותף - מתי זה הופך לבעיה משפטית?",
    description:"בבניינים משותפים רבים בישראל, השימוש ברכוש המשותף הוא נושא נפיץ שעלול להוביל לסכסוכים בין שכנים. אחד המקרים השכיחים ביותר הוא התקנת סוכך לחנייה - פעולה שנראית לכאורה פשוטה, אך עשויה להוביל למחלוקות משפטיות. אז מתי סוכך לחניה הופך לבעיה? ומתי השימוש בו נחשב סביר?",
    image: pic2,
    category: "real-estate",
  },
  {
    id: 3,
    headline: "מתי תאושר הפרדת ניהול בבית משותף?",
    description:"אחת הסוגייות המורכבות והטעונות ביותר בחיי היום יום של בתים משותפים היא השאלה: האם דייר או קבוצת דיירים יכולים להתנהל בנפרד משאר הבניין - כלכלית, תפעולית וניהולית? השאלה הזאת עולה בעיקר בבתים משותפים בעלי אגפים נפרדים, מבנים כפולים או כאשר מתקיימת תחושת קיפוח של חלק מהדיירים",
    image: pic3,
    category: "real-estate",
  },
  {
    id: 4,
    headline: "התקנת מצלמות ברכוש משותף - מה מותר ומה אסור?",
    description:"בשנים האחרונות, סוגיית התקנת מצלמות ברכוש המשותף הפכה לנושא מרכזי בדיונים בין שכנים בבית משותף. מצד אחד, בעלי הדירות מבקשים להתקין מצלמות להגנה על רכושם ושמירה על הביטחון, ומנגד, קיים חשש לפגיעה בפרטיות הדיירים האחרים. הפסיקה מגדירה מספר קריטריונים להערכת חוקיות התקנת מצלמות ברכוש משותף",
    image: pic4,
    category: "real-estate",
  },
  {
    id: 5,
    headline: "מתי חייב בעל הדירה להשתתף בשיפוץ?",
    description:"אחד הסכסוכים הנופצים ביותר בין שכנים בבניינין משותפים נוגע לשאלה: האם כל בעל דירה חייב להשתתף בעלויות שיפוץ של הרכוש המשותף - גם אם הוא מתנגד לכך?",
    image: pic5,
    category: "real-estate",
  },
  {
    id: 6,
    headline:"עושים סדר - מי משלם על תחוזקת הרכוש המשותף בבניין - ולפי מה מחשבים את זה?",
    description:"לפי סעיף 58(א) לחוק מקרקעין, כל בעל דירה בבניין משותף חייב להשתתף בהוצאות התחזוקה והניהול של הרכוש המשותף, כמו ניקיון, תאורנ, תיקונים ועוד. החישוב נעשה לפי גודל הדירה - כלומר, שטח הרצפה של הדירה עצמה(נטו), בלי חצרות, בלי גינות ובלי מחסנים צמודים.",
    image: pic6,
    category: "real-estate",
  },
  {
    id: 7,
    headline: "סובלים מרטיבות בדירה? אל תתעלמו - כך תטפלו נכון, בלי להסתבך עם השכן!",
    description: "מדריך קצר על רטיבות בבית משותף, אחריות ומה מותר ואסור לבקש מהמפקחת על רישום מקרקעין.",
    image: pic7,
    category: "real-estate",
  },
  {
    id: 8,
    headline: "בנייה על גג בית משותף - הזכות, המגבלה והמציאות.",
    description: "רבים רואים בגג הבית המשותף חלל מבוזבז - מקום של שמיים פתוחים שבאמצעות ניצולו ניתן לייצר ערך נדלני רב.",
    image: pic8,
    category: "real-estate",
  },
  {
    id: 9,
    headline: "האם די בהסכמה שבשתיקה לבנייה בבית משותף?",
    description: "בין שכנים בבית משותף, הסכמה היא מצרך נדיר ולעיתים קרובות - לא נאמרת בקול רם. פסד דין חשוב שפורסם לאחרונה עוסק בדיוק בשאלה הזו.",
    image: pic9,
    category: "real-estate",
  },
  {
    id: 10,
    headline: "האם קבלן יכול לשמור לעצמו חלקים מהרכוש המשותף ולמכור אותם בעתיד?",
    description: "בעלי דירות רבות מופתעים לגלות - לעיתים באיחור של שנים כי הקבלן שמכר להם את הדירה השאיר לעצמו חלקים מהרכוש המשותף.",
    image: pic10,
    category: "real-estate",
  },
  {
    id: 11,
    headline: "הסכם חנייה עם שכנים - האם זה הסכם שכנות טובה או התחייבות משפטית?",
    description: "תארו לעצמכם מצב נפוץ: דיירים בבית משותף מחליפים בניהם מקומות חנייה בהסכמה. אחד מהם מוכר את דירתו, הרוכש החדש נכנס לדירה - ואז מתחילה מלחמת עולם קטנה.",
    image: pic11,
    category: "real-estate",
  },
  {
    id: 13,
    headline: "האם רכשתם דירה עם גג או חצר מוצמדים? ייתכן שלא רכשתם את זכויות הבנייה - והמשמעות עלולה להיות יקרה.",
    description: "רכישת דירה הכוללת גג או חצר מוצמדים נשמעת כמו חלום נדלני - אך האם אתם בטוחים שאתם בעלי הזכות לבנות עליהם?",
    image: pic13,
    category: "real-estate",
  },
  {
    id: 14,
    headline: "זכויות בניה בבית משותף - בין חוזה לקניין.",
    description: "לפני הדיון של סוגיית זכויות הבנייה בבית משותף, יש להעמיד את הדברים על דיוקם ולהבחין בין רכוש משותף לזכויות בנייה, אשר אינן מהוות חלק בלתי נפרד מהרכוש המשותף, אלא מהוות נכס עצמאי הנתון להסדרה חוזית נפרדת.",
    image: pic14,
    category: "real-estate",
  },
  {
    id: 15,
    headline: "מעלון בבית משותף לאדם עם מוגבלויות - בין זכות לנגישות לבין פגיעה ברכוש המשותף.",
    description: "סוגיית התקנת מעלון בבית משותף עבור אדם עם מוגבלות ניצבת על התפר שבין זכויות פרט חוקתיות לבין אינטרסים קנייניים של כלל הדיירים.",
    image: pic15,
    category: "real-estate",
  },
  {
    id: 16,
    headline: "מעמדן של זכויות בניה בבית משותף: בין רכוש משותף להסכמות חוזיות.",
    description: "פסיקה עדכנית שדנה במעמדן של זכויות הבנייה בבית משותף חידדה פעם נוספת את הגבול בין קניין פרטי, רכוש משותף והיכולת להתנות או לשנות את חלוקת זכויות הבנייה באמצעות הסכמות חוזיות או תקנון מוסכם.",
    image: pic16,
    category: "real-estate",
  },
];

export const damageData = [
  {
    id: 17,
    headline: "זומנת לועדה רפואית? כך תדע למה כדאי לך להיות מיוצג על ידי עורן דין.",
    description: "פנייה לוועדה רפואית של ביטוח לאומי היא צעד מכריע שיכול לקבוע את עתידך הכלכלי והבריאותי.",
    image: pic17,
    category: "real-estate",
  },
  {
    id: 18,
    headline: "כיצד להיערך לועדה רפואית? מדריך מקיף לזכויותך ולשיקול דעתה של הוועדה.",
    description: "כאשר אדם חווה התדרדרות במצבו הבריאותי - עקב תאונה, מחלה או מגבלה כרונית - מתעורר הצורך למצות את זכויותיו מול גופים ממסדיים כמו המוסד לביטוח לאומי, מס הכנסה, קרנות הפנסיה, חברות הביטוח, משרד הבריאות או משרד הביטחון.",
    image: pic18,
    category: "real-estate",
  },
  {
    id: 19,
    headline: "למה חשוב לפנות לעורך דין לאחר תאונת דרכים?",
    description: "תאונות דרכים עלולות לשנות את מהלך החיים ברגע - כאב גופני, השלכות כלכליות והתמודדות לא פשוטה מול גופים ממסדיים כמו חברות ביטוח, ביטוח לאומי או קרנות פנסיה.",
    image: pic19,
    category: "real-estate",
  },
  {
    id: 20,
    headline: "מענק נכות ותגמולים בתביעה לשמרד הביטחון - זכויות על פי חוק הנכים(תגמולים ושיקום)",
    description: "חוק הנכים - הוא חוק סוציאלי מובהק, אשר מבטא את חובתה המוסרית והמשפטית של מדינת ישראל כלפי חייליה שנפגעו במהלך או עקב שירותם הצבאי.",
    image: pic20,
    category: "real-estate",
  },
  {
    id: 21,
    headline: "עורך דין או מרכז לשימוש זכויות רפואיות - מה עדיף?",
    description: "בפני אנשים המתמודדים עם מחלה, תאונה או מוגבלות רפואית, ניצבת לעיתים קרובות דילמה: האם לפנות לעורך דין הבקיא בדיני הביטוח הלאומי או להיעזר בשירותיהם של מרכזים פרטיים למימוש זכויות רפואיות?",
    image: pic21,
    category: "real-estate",
  },
  {
    id: 22,
    headline: "תאונות אופנוע: זכויות, סיכונים והבדלים משפטיים מתאונות רכב.",
    description: "תאונות אופנוע הן תאונות שכיחות בישראל, והנפגעים בהן עלולים לסבול מפגיעות חמורות במיוחד - הרבה יותר מתאונות רכב רגילות.",
    image: pic22,
    category: "real-estate",
  },
  {
    id: 23,
    headline: "ביטוח תאונות אישיות לתלמידים – מה ההורים לא יודעים ויכולים להרוויח?",
    description: "רבים מההורים אינם מודעים לכך שילדיהם מבוטחים בביטוח תאונות אישיות במסגרת מערכת החינוך, ביטוח שמעניק כיסוי רחב 24/7 – גם מחוץ לשעות הלימודים, בבית ובחוגים. מדובר בזכות שמגיעה לכל תלמיד מגיל גן ועד לסיום כיתה יב ולעיתים ההורים מגלים אותה רק לאחר פציעה מצערת",
    image: pic24,
    category: "real-estate",
  },
  {
    id: 24,
    headline: "תאונות עבודה, מחלות מקצוע ומיקרוטראומה – מה חשוב שכל עובד ידע?",
    description: "יוסי, איש מחשבים בחברת הייטק מזה למעלה משני עשורים, פנה למשרדנו לאחר שחש בכאבים עזים בידיים ובשורש כף היד. האבחנה הרפואית קבעה כי מדובר בתסמונת התעלה הקרפלית (Carpal Tunnel Syndrome – CTS), מצב שכיח אצל עובדים שמבצעים הקלדה ושימוש בעכבר מחשב במשך שעות רבות ביום. השאלה שעלתה היא – האם מדובר בתאונת עבודה? מחלת מקצוע? או אולי מיקרוטראומה",
    image: pic23,
    category: "real-estate",
  },
];
